{
  "chapter_number": 2,
  "title": "Garden of Eden",
  "summary": "God creates man and woman, places them in the Garden of Eden, and establishes the first covenant.",
  "themes": [
    "Creation",
    "Marriage",
    "Human purpose",
    "Stewardship",
    "Covenant"
  ],
  "people": [
    "God",
    "Adam",
    "Eve"
  ],
  "places": [
    "Garden of Eden",
    "Rivers of Eden"
  ],
  "timeframe": "Seventh day and after creation",
  "symbols": [
    "Tree of Life",
    "Tree of Knowledge of Good and Evil",
    "Rivers",
    "Marriage"
  ],
  "narrative": "After completing the cosmic creation, God focuses on humanity. First creating Adam from dust and breathing life into him, God then places him in a lush garden filled with every tree pleasing to the eye and good for food. Two special trees stand at its center: the Tree of Life and the Tree of Knowledge of Good and Evil. God commands Adam to tend the garden but warns him not to eat from the Tree of Knowledge, for it would bring death. Seeing Adam's need for companionship, God creates the animals for Adam to name, then forms Eve from Adam's rib, establishing the sacred bond of marriage between man and woman.",
  "connections": [
    {
      "id": "Matthew 19:4-6",
      "type": "thematic",
      "theme": "Marriage",
      "explanation": "Jesus references Genesis 2 when teaching about marriage and divorce."
    },
    {
      "id": "Revelation 22:1-2",
      "type": "symbolic",
      "theme": "Tree of Life",
      "explanation": "The Tree of Life reappears in the New Jerusalem, showing God's restoration of Eden."
    }
  ],
  "verses": [
    {
      "verse_number": 1,
      "text": {
        "kjv": "Thus the heavens and the earth were finished, and all the host of them.",
        "web": "The heavens, the earth, and all their vast array were finished."
      },
      "tags": {
        "themes": ["Creation completion"],
        "people": ["God"],
        "places": ["Heaven", "Earth"],
        "symbols": [],
        "emotions": [],
        "timeframe": ["End of creation week"],
        "cross_refs": []
      }
    },
    {
      "verse_number": 2,
      "text": {
        "kjv": "And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made.",
        "web": "On the seventh day God finished his work which he had done; and he rested on the seventh day from all his work which he had done."
      },
      "tags": {
        "themes": ["Sabbath", "Rest", "Creation completion"],
        "people": ["God"],
        "places": [],
        "symbols": ["Seventh day"],
        "emotions": [],
        "timeframe": ["Seventh day"],
        "cross_refs": ["Exodus 20:8-11", "Hebrews 4:4-10"]
      }
    },
    {
      "verse_number": 3,
      "text": {
        "kjv": "And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.",
        "web": "God blessed the seventh day, and made it holy, because he rested in it from all his work of creation which he had done."
      },
      "tags": {
        "themes": ["Sabbath", "Holiness", "Blessing"],
        "people": ["God"],
        "places": [],
        "symbols": ["Seventh day"],
        "emotions": [],
        "timeframe": ["Seventh day"],
        "cross_refs": ["Exodus 20:8-11"]
      }
    },
    {
      "verse_number": 4,
      "text": {
        "kjv": "These are the generations of the heavens and of the earth when they were created, in the day that the LORD God made the earth and the heavens,",
        "web": "This is the history of the generations of the heavens and of the earth when they were created, in the day that Yahweh God made the earth and the heavens."
      }
    },
    {
      "verse_number": 5,
      "text": {
        "kjv": "And every plant of the field before it was in the earth, and every herb of the field before it grew: for the LORD God had not caused it to rain upon the earth, and there was not a man to till the ground.",
        "web": "No plant of the field was yet in the earth, and no herb of the field had yet sprung up; for Yahweh God had not caused it to rain on the earth. There was not a man to till the ground,"
      }
    }
  ]
}